html/blog/nixos.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-16 Sat 18:03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NixOS</title>
<meta name="author" content="Arvydas G." />
<meta name="description" content="welcome to my site" />
<meta name="keywords" content="emacs antanas geles" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../static/style.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="sitemap.html"> HOME </a>
</div><div id="preamble" class="status">
<div id="created">Page creation date(kodel 3
	 skirtingos datos???): 2023-12-16 Sat 08:03</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">NixOS</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5512841">1. Why NixOS</a></li>
<li><a href="#org330a672">2. Why NixOS by others</a></li>
<li><a href="#orgf13accd">3. Documentation</a></li>
<li><a href="#org51bf963">4. Installation on WSL</a>
<ul>
<li><a href="#org0339b9d">4.1. Configure the installation over emacs</a>
<ul>
<li><a href="#org76a2bf7">4.1.1. Using your own custom nixos configuration file</a></li>
<li><a href="#org4465168">4.1.2. Setting up git</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org5512841" class="outline-2">
<h2 id="org5512841"><span class="section-number-2">1.</span> <a href="#org5512841">Why NixOS</a></h2>
<div class="outline-text-2" id="text-1">
<p>
AFTER you reinstall your computer - to install the DEV environment, all you
have to take with you is <code>/etc/nixos/configuration.nix</code> file, everything is
described in it. Amazing!
</p>

<p>
Avoid long reinstall &amp; config process
</p>
</div>
</div>

<div id="outline-container-org330a672" class="outline-2">
<h2 id="org330a672"><span class="section-number-2">2.</span> <a href="#org330a672">Why NixOS by others</a></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="https://github.com/hlissner/dotfiles">https://github.com/hlissner/dotfiles</a></li>
<li><a href="https://github.com/terlar/nix-config">https://github.com/terlar/nix-config</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf13accd" class="outline-2">
<h2 id="orgf13accd"><span class="section-number-2">3.</span> <a href="#orgf13accd">Documentation</a></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>nixos github repo - <a href="https://github.com/nix-community/NixOS-WSL">https://github.com/nix-community/NixOS-WSL</a></li>
<li>nixos manual - <a href="https://nixos.org/manual/nix/stable/">https://nixos.org/manual/nix/stable/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org51bf963" class="outline-2">
<h2 id="org51bf963"><span class="section-number-2">4.</span> <a href="#org51bf963">Installation on WSL</a></h2>
<div class="outline-text-2" id="text-4">
<p>
Steps described here:
</p>

<p>
<a href="https://github.com/nix-community/NixOS-WSL">https://github.com/nix-community/NixOS-WSL</a>
</p>

<p>
But basically download nixos-wsl.tar.gz into your windows /Download folder
</p>

<p>
Then in CMD run(while in /Downloads folder):
</p>
<div class="org-src-container">
<pre class="src src-bash">wsl --import NixOS .\NixOS\ nixos-wsl.tar.gz --version 2
</pre>
</div>

<p>
check if it was really installed:
</p>
<div class="org-src-container">
<pre class="src src-bash">wsl -l -v
</pre>
</div>

<p>
You should see NixOS listed. Now we can run nixos:
</p>
<div class="org-src-container">
<pre class="src src-bash">wsl -d NixOS
</pre>
</div>

<p>
After the initial installation, you need to update your channels once, to be
able to use <code>nixos-rebuild</code>:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo nix-channel --add https://nixos.org/channels/nixos-23.11 nixos
sudo nix-channel --update
</pre>
</div>
</div>

<div id="outline-container-org0339b9d" class="outline-3">
<h3 id="org0339b9d"><span class="section-number-3">4.1.</span> <a href="#org0339b9d">Configure the installation over emacs</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
Enter nix-shell to use emacs(it does not get installed on the system, just
<a href="https://nix.dev/tutorials/first-steps/ad-hoc-shell-environments">TEMPORARILY</a> FROM NIXOS CACHE?). So I can then modify the
<code>/etc/nixos/configuration.nix</code> file.
</p>
<div class="org-src-container">
<pre class="src src-bash">nix-shell -p emacs29
</pre>
</div>

<p>
Then let's run emacs in nix-shell(run with sudo)
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo emacs
</pre>
</div>

<p>
Ok now you are in emacs, but in nix-shell. If we turn off nixos now, when we
launch it again, emacs will not be available. Only after you run <code>nix-shell -p
emacs</code>. Let's install emacs permanetely:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo emacs /etc/nixos/configuration.nix
</pre>
</div>

<p>
add these lines:
</p>
<div class="org-src-container">
<pre class="src src-nix">environment.systemPackages = with pkgs; [
  emacs29
  git
];
</pre>
</div>

<p>
We Install emacs29 because of <code>seq keep error message</code> (check in <a href="emacs.html">emacs.html</a>)
</p>

<p>
after you do that, <code>C-d</code> to go back to nixos@nixos(out of nix-shell) and BUILD
the nixos with the new changes(emacs installation).
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo nixos-rebuild switch
</pre>
</div>

<p>
After this runs, you should be able to use Emacs and use git!
</p>

<p>
Clone the dotfiles repo:
</p>
<div class="org-src-container">
<pre class="src src-bash">mkdir ~/GIT
cd ~/GIT
git clone https://github.com/arvydasg/dotfiles
ln -s GIT/dotfiles/.emacs.d/ ~/.emacs.d
cd ~/.emacs.d
git update-index --assume-unchanged init.el
</pre>
</div>

<p>
Try to launch emacs for all the packages to be installed.
</p>
</div>

<div id="outline-container-org76a2bf7" class="outline-4">
<h4 id="org76a2bf7"><span class="section-number-4">4.1.1.</span> <a href="#org76a2bf7">Using your own custom nixos configuration file</a></h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
It suchs to not be able to edit the <code>/etc/nixos/configuration.nix</code> file over
emacs as nixos default user. I want this file to not be owned by root, but bu
nixos user. So what we will do is we will:
</p>

<div class="org-src-container">
<pre class="src src-bash"># delete current nixos directory
sudo rm -rf /etc/nixos
# put our config folder instead of the default one
sudo ln -s ~/GIT/dotfiles/nixos/ /etc/nixos
</pre>
</div>

<p>
You are done. Should be able to edit <code>configuration.nix</code> file now.
</p>
</div>
</div>

<div id="outline-container-org4465168" class="outline-4">
<h4 id="org4465168"><span class="section-number-4">4.1.2.</span> <a href="#org4465168">Setting up git</a></h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
<code>Introduce yourself to git</code> in  . Any of those methods. Will go the personal access
token route this time.
</p>

<p>
HELLO
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arvydas G. (<a href="mailto:arvydas.gaspa@gmail.com">arvydas.gaspa@gmail.com</a>)</p>
<p class="date">Date: 2023-12-13 Wed 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="https://orgmode.org">Org</a> mode 9.6.6)</p>
<p class="validation"></p>
</div>
<script>window.klipse_settings = {selector_eval_html: '.src-html',
                             selector_eval_js: '.src-js',
                             selector_eval_python_client: '.src-python',
                             selector_eval_scheme: '.src-scheme',
                             selector: '.src-clojure',
                             selector_eval_ruby: '.src-ruby'};</script><script src="https://storage.googleapis.com/app.klipse.tech/plugin_prod/js/klipse_plugin.min.js"></script><link rel="stylesheet" type="text/css" href="https://storage.googleapis.com/app.klipse.tech/css/codemirror.css"/></body>
</html>